Revit 2027 API
ParameterTypeId.BoundaryLinearRestraintRotX Property
 "X Rotation Spring Modulus"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId BoundaryLinearRestraintRotX { get; }
Public Shared ReadOnly Property BoundaryLinearRestraintRotX As ForgeTypeId
	Get
public:
static property ForgeTypeId^ BoundaryLinearRestraintRotX {
	ForgeTypeId^ get ();
}
static member BoundaryLinearRestraintRotX : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace